In [ ]:
import pandas as pd
import numpy as np

### day 1 of pandas

####  Create a Series from a Python list.

In [3]:
py_list=[10,20,30,"a","b"]
print(py_list)
ser=pd.Series(py_list,name="numbers")
ser.to_frame()

[10, 20, 30, 'a', 'b']

  numbers
0      10
1      20
2      30
3       a
4       b

#### Create a DataFrame from a dictionary.

In [4]:
dic={
    "name":["swalih","husna"],
    "mark":[75,90]
}
dic

{'name': ['swalih', 'husna'], 'mark': [75, 90]}

In [5]:
ind=[1,2]

df=pd.DataFrame(dic)
df.index=ind
df

     name  mark
1  swalih    75
2   husna    90

#### Rename the columns of a DataFrame.

In [6]:
dic={
    "name":["swalih","husna"],
    "mark":[75,90]
}
ind=[1,2]

df=pd.DataFrame(dic)
df.index=ind
df

     name  mark
1  swalih    75
2   husna    90

In [7]:
df.columns=["Names","Marks"]
df

    Names  Marks
1  swalih     75
2   husna     90

#### Add a new column to a DataFrame that calculates the square of another column.

In [8]:
dic={
    "name":["swalih","husna"],
    "mark":[75,90]
}
ind=[1,2]

df=pd.DataFrame(dic)
df.index=ind
df["age"]=[21,21]
df

     name  mark  age
1  swalih    75   21
2   husna    90   21

In [9]:
topper=df[df["mark"]>80]
topper

    name  mark  age
2  husna    90   21

In [10]:
name=topper["name"]
name.to_frame()

    name
2  husna

In [11]:
df.T

           1      2
name  swalih  husna
mark      75     90
age       21     21

#### creat a dic and convert into dataframe

In [ ]:


data = {
    "Name": [
        "Alice", "Bob", "Charlie", "David", "Eva",
        "Frank", "Grace", "Hannah", "Ian", "Jack",
        "Karen", "Leo", "Mona", "Nina", "Oscar",
        "Paul", "Quincy", "Rachel", "Steve", "Tina"
    ],
    "Age": [
        25, 30, 22, 28, 35,
        40, 27, 32, 29, 24,
        31, 26, 33, 21, 38,
        36, 23, 34, 29, 28
    ]
}

df = pd.DataFrame(data)
print(df)

       Name  Age
0     Alice   25
1       Bob   30
2   Charlie   22
3     David   28
4       Eva   35
5     Frank   40
6     Grace   27
7    Hannah   32
8       Ian   29
9      Jack   24
10    Karen   31
11      Leo   26
12     Mona   33
13     Nina   21
14    Oscar   38
15     Paul   36
16   Quincy   23
17   Rachel   34
18    Steve   29
19     Tina   28